Autodesk.Revit.DB.CompoundStructureLayer.LayerPriority
The priority of the layer.
Remarks:
The effective priority value should be between 1-5. Membrane layers should not have a priority, the value should be 999.
You should set the layer priority if you want a customized priority value rather than the default one by function.
In shell, a non-membrane layer which is closer to the core should not have a lower priority.
Since:
2026

Autodesk.Revit.DB.CompoundStructureLayer.#ctor(System.Double,Autodesk.Revit.DB.MaterialFunctionAssignment,Autodesk.Revit.DB.ElementId)
Creates a default compound structure layer based on the given width, function and material element id. The priority is initialized with 999.
width:
The width of the layer.
function:
The function of the layer.
materialId:
The material element id of the layer.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration